fustyles/Arduino/ESP32-CAM_MyBlockly_JSON_PAGE/app_httpd.cpp
/*
ESP32-CAM MyBlock
Author : ChungYi Fu (Kaohsiung, Taiwan)  2019-12-13 22:00
https://www.facebook.com/francefu

Command Format :  
http://APIP/control?cmd=P1;P2;P3;P4;P5;P6;P7;P8;P9
http://STAIP/control?cmd=P1;P2;P3;P4;P5;P6;P7;P8;P9

Default APIP： 192.168.4.1
http://192.168.4.1/control?ip
http://192.168.4.1/control?mac
http://192.168.4.1/control?restart
http://192.168.4.1/control?inputpullup=pin
http://192.168.4.1/control?pinmode=pin;value
http://192.168.4.1/control?digitalwrite=pin;value
http://192.168.4.1/control?analogwrite=pin;value
http://192.168.4.1/control?digitalread=pin
http://192.168.4.1/control?analogread=pin
http://192.168.4.1/control?touchread=pin
http://192.168.4.1/control?tcp=domain;port;request;wait
--> wait = 0 or 1  (waiting for response)
--> request = /xxxx/xxxx
http://192.168.4.1/control?ifttt=event;key;value1;value2;value3
http://192.168.4.1/control?thingspeakupdate=key;field1;field2;field3;field4;field5;field6;field7;field8
http://192.168.4.1/control?thingspeakread=request
--> request = /channels/xxxxx/fields/1.jsoncontrol?results=1
http://192.168.4.1/control?linenotify=token;request
--> request = message=xxxxx

http://192.168.4.1/control?flash=value        //vale= 0~255
http://192.168.4.1/control?servo=value        //vale= 1700~8000
http://192.168.4.1/control?servo1=value       //vale= 1700~8000
http://192.168.4.1/control?servo2=value       //vale= 1700~8000
http://192.168.4.1/control?speedL=value       //vale= 0~255
http://192.168.4.1/control?speedR=value       //vale= 0~255
http://192.168.4.1/control?decelerate=value   //vale= 0~100  (%)
http://192.168.4.1/control?car=state          //state= 1(Front),2(Left),3(Stop),4(Right),5(Back),6(FrontLeft),7(FrontRight),8(LeftAfter),9(RightAfter)
http://192.168.4.1/control?framesize=size     //size= UXGA|SXGA|XGA|SVGA|VGA|CIF|QVGA|HQVGA|QQVGA

http://192.168.4.1:81/stream   //Stream Video
http://192.168.4.1/capture   //Image

STAIP：
Query：http://192.168.4.1/control?ip
Link：http://192.168.4.1/control?resetwifi=ssid;password

If you don't need to get response from ESP8266 and want to execute commands quickly, 
you can append a parameter value "stop" at the end of command.
For example:
http://192.168.4.1/control?digitalwrite=gpio;value;stop
http://192.168.4.1/control?restart=stop
*/

#include "Base64.h"
#include "Arduino.h"
#include <esp32-hal-ledc.h>
#include <WiFi.h>
#include <HTTPClient.h>
HTTPClient http;

int speedR = 255;  //You can adjust the speed of the wheel. (gpio12, gpio13)
int speedL = 255;  //You can adjust the speed of the wheel. (gpio14, gpio15)
int servoPin = 2;
int servo1Pin = 2;
int servo2Pin = 13;
double decelerate = 60;

//For Webbit
#define HTTPD_MY_CONFIG() {                        \
       .task_priority      = tskIDLE_PRIORITY+5,       \
       .stack_size         = 4096,                     \    
       .server_port        = 20975,                    \  
       .ctrl_port          = 32768,                    \
       .max_open_sockets   = 7,                        \
       .max_uri_handlers   = 8,                        \
       .max_resp_headers   = 8,                        \
       .backlog_conn       = 5,                        \
       .lru_purge_enable   = false,                    \
       .recv_wait_timeout  = 5,                        \
       .send_wait_timeout  = 5,                        \
       .global_user_ctx = NULL,                        \
       .global_user_ctx_free_fn = NULL,                \
       .global_transport_ctx = NULL,                   \
       .global_transport_ctx_free_fn = NULL,           \
       .open_fn = NULL,                                \
       .close_fn = NULL,                               \
} 

// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"

#include "fb_gfx.h"
#include "fd_forward.h"
#include "dl_lib.h"
#include "fr_forward.h"

String Feedback="";
String Command="";
String cmd="";
String P1="";
String P2="";
String P3="";
String P4="";
String P5="";
String P6="";
String P7="";
String P8="";
String P9="";
byte ReceiveState=0;
byte cmdState=1;
byte strState=1;
byte questionstate=0;
byte equalstate=0;
byte semicolonstate=0;
void getCommand(char);
String getstill();
String urlencode(String);
String tcp_http(String,String,int,byte);
String LineNotify(String, String, byte);

#define ENROLL_CONFIRM_TIMES 5
#define FACE_ID_SAVE_NUMBER 7

#define FACE_COLOR_WHITE  0x00FFFFFF
#define FACE_COLOR_BLACK  0x00000000
#define FACE_COLOR_RED    0x000000FF
#define FACE_COLOR_GREEN  0x0000FF00
#define FACE_COLOR_BLUE   0x00FF0000
#define FACE_COLOR_YELLOW (FACE_COLOR_RED | FACE_COLOR_GREEN)
#define FACE_COLOR_CYAN   (FACE_COLOR_BLUE | FACE_COLOR_GREEN)
#define FACE_COLOR_PURPLE (FACE_COLOR_BLUE | FACE_COLOR_RED)

typedef struct {
        size_t size; //number of values used for filtering
        size_t index; //current value index
        size_t count; //value count
        int sum;
        int * values; //array to be filled with values
} ra_filter_t;

typedef struct {
        httpd_req_t *req;
        size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char* _STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char* _STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char* _STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";

