fustyles/Arduino/ESP32-CAM_MyBlockly_JSON_PAGE/app_httpd.cpp
        int64_t ready_time = (fr_ready - fr_start)/1000;
        int64_t face_time = (fr_face - fr_ready)/1000;
        int64_t recognize_time = (fr_recognize - fr_face)/1000;
        int64_t encode_time = (fr_encode - fr_recognize)/1000;
        int64_t process_time = (fr_encode - fr_start)/1000;
        
        int64_t frame_time = fr_end - last_frame;
        last_frame = fr_end;
        frame_time /= 1000;
        uint32_t avg_frame_time = ra_filter_run(&ra_filter, frame_time);
        Serial.printf("MJPG: %uB %ums (%.1ffps), AVG: %ums (%.1ffps), %u+%u+%u+%u=%u %s%d\n",
            (uint32_t)(_jpg_buf_len),
            (uint32_t)frame_time, 1000.0 / (uint32_t)frame_time,
            avg_frame_time, 1000.0 / avg_frame_time,
            (uint32_t)ready_time, (uint32_t)face_time, (uint32_t)recognize_time, (uint32_t)encode_time, (uint32_t)process_time,
            (detected)?"DETECTED ":"", face_id
        );
    }

    last_frame = 0;
    return res;
}

static esp_err_t cmd_handler(httpd_req_t *req){
    char*  buf;
    size_t buf_len;
    char variable[32] = {0,};
    char value[32] = {0,};
    String myCmd = "";

    buf_len = httpd_req_get_url_query_len(req) + 1;
    if (buf_len > 1) {
        buf = (char*)malloc(buf_len);
        
        if(!buf){
            httpd_resp_send_500(req);
            return ESP_FAIL;
        }
        if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
          if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) == ESP_OK &&
            httpd_query_key_value(buf, "val", value, sizeof(value)) == ESP_OK) {
          } 
          else {
            myCmd = String(buf);
          }
        }
    } else {
        httpd_resp_send_404(req);
        return ESP_FAIL;
    }

    Command="";cmd="";P1="";P2="";P3="";P4="";P5="";P6="";P7="";P8="";P9="";
    ReceiveState=0,cmdState=1,strState=1,questionstate=0,equalstate=0,semicolonstate=0;     
    if (myCmd.length()>0) {
      myCmd = "?"+myCmd;
      for (int i=0;i<myCmd.length();i++) {
        getCommand(char(myCmd.charAt(i)));
      }
    }

    if (cmd.length()>0) {
      Serial.println("");
      //Serial.println("Command: "+Command);
      Serial.println("cmd= "+cmd+" ,P1= "+P1+" ,P2= "+P2+" ,P3= "+P3+" ,P4= "+P4+" ,P5= "+P5+" ,P6= "+P6+" ,P7= "+P7+" ,P8= "+P8+" ,P9= "+P9);
      Serial.println(""); 
          
      if (cmd=="your cmd") {
        // You can do anything
        // Feedback="<font color=\"red\">Hello World</font>";
      }
      else if (cmd=="ip") {
        Feedback="AP IP: "+WiFi.softAPIP().toString();    
        Feedback+=", ";
        Feedback+="STA IP: "+WiFi.localIP().toString();
      }  
      else if (cmd=="mac") {
        Feedback="STA MAC: "+WiFi.macAddress();
      }  
      else if (cmd=="restart") {
        ESP.restart();
      }           
      else if (cmd=="inputpullup") {
        pinMode(P1.toInt(), INPUT_PULLUP);
      }  
      else if (cmd=="pinmode") {
        if (P2.toInt()==1)
          pinMode(P1.toInt(), OUTPUT);
        else
          pinMode(P1.toInt(), INPUT);
      }        
      else if (cmd=="digitalwrite") {
        ledcDetachPin(P1.toInt());
        pinMode(P1.toInt(), OUTPUT);
        digitalWrite(P1.toInt(), P2.toInt());
      }   
      else if (cmd=="digitalread") {
        Feedback=String(digitalRead(P1.toInt()));
      }
      else if (cmd=="analogwrite") {
        if (P1=="2") {
          ledcAttachPin(2, 3);  
          ledcSetup(3, 5000, 8);
          ledcWrite(3,P2.toInt());     
        }    
        else if (P1=="4") {
          ledcAttachPin(4, 4);  
          ledcSetup(4, 5000, 8);
          ledcWrite(4,P2.toInt());     
        }
        else if (P1=="12") {
          ledcAttachPin(12, 5);  
          ledcSetup(5, 5000, 8);
          ledcWrite(5,P2.toInt());     
        }
        else if (P1=="13") {
          ledcAttachPin(13, 6);  
          ledcSetup(6, 5000, 8);
          ledcWrite(6,P2.toInt());     
        }
        else if (P1=="14") {
          ledcAttachPin(14, 8);  
          ledcSetup(8, 5000, 8);
          ledcWrite(8,P2.toInt());     
        }
        else if (P1=="15") {
          ledcAttachPin(15, 7);  
          ledcSetup(7, 5000, 8);
          ledcWrite(7,P2.toInt());     
        }
        else {
          ledcAttachPin(P1.toInt(), 9);
          ledcSetup(9, 5000, 8);
          ledcWrite(9,P2.toInt());
        }
      }       
      else if (cmd=="analogread") {
        Feedback=String(analogRead(P1.toInt()));
      }
      else if (cmd=="touchread") {
        Feedback=String(touchRead(P1.toInt()));
      }   
      else if (cmd=="tcp") {
        String domain=P1;
        int port=P2.toInt();
        String request=P3;
        int wait=P4.toInt();      // wait = 0 or 1
    
        Feedback=tcp_http(domain,request,port,wait);  
      }
      else if (cmd=="ifttt") {
        String domain="maker.ifttt.com";
        String request = "/trigger/" + P1 + "/with/key/" + P2;
        request += "?value1="+P3+"&value2="+P4+"&value3="+P5;
        Feedback=tcp_http(domain,request,80,0);
      }
      else if (cmd=="thingspeakupdate") {
        String domain="api.thingspeak.com";
        String request = "/update?api_key=" + P1;
        request += "&field1="+P2+"&field2="+P3+"&field3="+P4+"&field4="+P5+"&field5="+P6+"&field6="+P7+"&field7="+P8+"&field8="+P9;
        Feedback=tcp_http(domain,request,80,0);
      }    
      else if (cmd=="thingspeakread") {
        String domain="api.thingspeak.com";
        String request = P1;
        Feedback=tcp_http(domain,request,80,1);
        int s=Feedback.indexOf("feeds");
        Feedback=Feedback.substring(s+8);
        int e=Feedback.indexOf("]");
        Feedback=Feedback.substring(0,e);
        Feedback.replace("},{",";");
        Feedback.replace("\":\"",",");
        Feedback.replace("\":",",");
        Feedback.replace("\",\"",","); 
        Feedback.replace("\"","");
        Feedback.replace("{","");
        Feedback.replace("}","");
        Feedback.replace("[","");
        Feedback.replace("]","");
        Feedback.replace(",\"",",");
        Feedback.replace("\":",",");
      } 
      else if (cmd=="linenotify") {
        String token = P1;
        String request = P2;
        Feedback=LineNotify(token,request,1);
        //Serial.println(Feedback);
        if (Feedback.indexOf("status")!=-1) {
          int s=Feedback.indexOf("<body>");
          Feedback=Feedback.substring(s+6);
          int e=Feedback.indexOf("<");
          Feedback=Feedback.substring(0,e);
        }
      } 
      else if (cmd=="flash") {
        ledcAttachPin(4, 4);  
        ledcSetup(4, 5000, 8);   
         
        int val = P1.toInt();
        ledcWrite(4,val);  
      }  
      else if (cmd=="servo") {
        ledcAttachPin(servoPin, 3);  
        ledcSetup(3, 50, 16);
        
        int val = P1.toInt();      
        if (val > 8000)
           val = 8000;
        else if (val < 1700)
          val = 1700;   
        val = 1700 + (8000 - val);   
        ledcWrite(3, val); 
      }  
      else if (cmd=="servo1") {
        ledcAttachPin(servo1Pin, 3);  
        ledcSetup(3, 50, 16); 
        
        int val = P1.toInt();     
        if (val > 8000)
           val = 8000;
        else if (val < 1700)
          val = 1700;   
        val = 1700 + (8000 - val);   
        ledcWrite(3, val); 
      }  
      else if (cmd=="servo2") {
        ledcAttachPin(servo2Pin, 6);  
        ledcSetup(6, 50, 16); 
        
        int val = P1.toInt();     
        if (val > 8000)
           val = 8000;
        else if (val < 1700)
          val = 1700;   
        val = 1700 + (8000 - val);   
        ledcWrite(6, val); 
      }
      else if (cmd=="speedL") {
        int val = P1.toInt();
        if (val > 255)
           val = 255;
        else if (val < 0)
          val = 0;       
        speedL = val;
        Serial.println("LeftSpeed = " + String(val)); 
      }  
      else if (cmd=="speedR") {
        int val = P1.toInt();
        if (val > 255)
           val = 255;
        else if (val < 0)
          val = 0;       
        speedR = val;
        Serial.println("RightSpeed = " + String(val)); 
      }  
      else if (cmd=="decelerate") { 
        int val = P1.toInt();      
        decelerate = val;
        Serial.println("Decelerate = " + String(val)); 
      }   
      else if (cmd=="car") {
        ledcAttachPin(12, 5);
        ledcSetup(5, 2000, 8);      
        ledcAttachPin(13, 6);
        ledcSetup(6, 2000, 8);
        ledcWrite(6, 0);  
        ledcAttachPin(15, 7);
        ledcSetup(7, 2000, 8);      
        ledcAttachPin(14, 8);
        ledcSetup(8, 2000, 8); 
          
        int val = P1.toInt();
        if (val==1) {
          Serial.println("Front");     
          ledcWrite(5,speedR);
          ledcWrite(6,0);
          ledcWrite(7,speedL);
          ledcWrite(8,0);   
        }
        else if (val==2) {
          Serial.println("Left");     
          ledcWrite(5,speedR*decelerate/100);
          ledcWrite(6,0);
          ledcWrite(7,0);
          ledcWrite(8,speedL*decelerate/100);  
        }
        else if (val==3) {
          Serial.println("Stop");      
          ledcWrite(5,0);
          ledcWrite(6,0);
          ledcWrite(7,0);
          ledcWrite(8,0);    
        }
        else if (val==4) {
          Serial.println("Right");
          ledcWrite(5,0);
          ledcWrite(6,speedR*decelerate/100);
          ledcWrite(7,speedL*decelerate/100);
          ledcWrite(8,0);          
        }
        else if (val==5) {
          Serial.println("Back");      
          ledcWrite(5,0);
          ledcWrite(6,speedR);
          ledcWrite(7,0);
          ledcWrite(8,speedL);
        }  
        else if (val==6) {
          Serial.println("FrontLeft");     
          ledcWrite(5,speedR);
          ledcWrite(6,0);
          ledcWrite(7,speedL*decelerate/100);
          ledcWrite(8,0);   
        }
        else if (val==7) {
          Serial.println("FrontRight");     
          ledcWrite(5,speedR*decelerate/100);
          ledcWrite(6,0);
          ledcWrite(7,speedL);
          ledcWrite(8,0);   
        }  
        else if (val==8) {
          Serial.println("LeftAfter");      
          ledcWrite(5,0);
          ledcWrite(6,speedR);
          ledcWrite(7,0);
          ledcWrite(8,speedL*decelerate/100);
        } 
        else if (val==9) {
          Serial.println("RightAfter");      
          ledcWrite(5,0);
          ledcWrite(6,speedR*decelerate/100);
          ledcWrite(7,0);
          ledcWrite(8,speedL);
        }       
      }     
      else if (cmd=="framesize") { 
        sensor_t * s = esp_camera_sensor_get();  
        if (P1=="QQVGA")
          s->set_framesize(s, FRAMESIZE_QQVGA);
        else if (P1=="HQVGA")
          s->set_framesize(s, FRAMESIZE_HQVGA);
        else if (P1=="QVGA")
          s->set_framesize(s, FRAMESIZE_QVGA);
        else if (P1=="CIF")
          s->set_framesize(s, FRAMESIZE_CIF);
        else if (P1=="VGA")
          s->set_framesize(s, FRAMESIZE_VGA);
        else if (P1=="SVGA")
          s->set_framesize(s, FRAMESIZE_SVGA);
        else if (P1=="XGA")
          s->set_framesize(s, FRAMESIZE_XGA);
        else if (P1=="SXGA")
          s->set_framesize(s, FRAMESIZE_SXGA);
        else if (P1=="UXGA")
          s->set_framesize(s, FRAMESIZE_UXGA);          
        else 
          s->set_framesize(s, FRAMESIZE_CIF);    
      }  
      else {
        Feedback="Command is not defined";
      }       
    
      static char json_response[4096];
      char * p = json_response;
      *p++ = '[{';
      p+=sprintf(p, "\"data\":\"%s\"", Feedback.c_str());
      *p++ = '}]';
      *p++ = 0;
      httpd_resp_set_type(req, "application/json");
      httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
      return httpd_resp_send(req, json_response, strlen(json_response));
    } 
    else {
      int val = atoi(value);
      sensor_t * s = esp_camera_sensor_get();
      int res = 0;
      
